"""Все пятибуквенные слова, составленные из букв А, К, Ц, Е, Н, Т, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1. ААААА
2. ААААA
3. ААААК
4. ААААН
5. ААААТ
6. ААААЦ
……
Определите, под каким номером в этом списке стоит первое слово с чётным номером, которое не начинается с букв А, Е или К и при этом содержит в своей записи не менее одной буквы Т.
Примечание. Слово – последовательность идущих подряд букв, не обязательно осмысленная"""
import itertools
a = 'AEKNTC'
words = itertools.product(a, repeat=5)
i = 1
for el in words:
    word = ''.join(el)
    if i %2 == 0 and word[0] not in 'AEK' and 'T' in word:
        print(i)
    i+=1
