"""В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество пар последовательности, в которых элементы не равны, а абсолютное значение их разности делится на минимальный положительный элемент последовательности, кратный 33. Гарантируется, что такой элемент последовательности есть. ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар.
В данной задаче под парой подразумевается два идущих подряд элемента последовательности."""
c = 0
maxsum = 0
nums = []
minel = 100001
with open('task.txt', 'r') as file:
    for line in file:
        number = int(line.strip())
        nums.append(number)
        if minel > number and number % 33 == 0 and number > 0:
            minel = number
    for i in range(len(nums)-1):
        a = nums[i]
        b = nums[i + 1]
        if a != b and abs(a - b) % minel == 0 :
            c += 1
            summ = a + b
            if summ > maxsum:
                maxsum = summ
print(c, maxsum)
