"""В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых ни одно число не является отрицательным, а сумма элементов тройки не меньше максимального элемента последовательности, оканчивающегося на 11. В ответе запишите количество найденных троек, затем минимальную из сумм элементов таких троек. В данной задаче под тройкой подразумеваются три идущих подряд элемента последовательности."""
maxel = 0
nums = []
s = 0
minsum = 100000*3
with open('2.txt', 'r') as file:
    for  line in file:
        number = int(line.strip())
        nums.append(number)
        if number > maxel and number % 100 == 11:
            maxel = number
for i in range(1, len(nums) -1):
    a = nums[i-1]
    b = nums[i]
    c = nums[i+1]
    if a > 0  and b > 0 and c > 0 and (a +b +c) >= maxel: # all(x > 0 for x in (a, b, c))
        s += 1
        summ = a + b +c
        if summ < minsum:
            minsum = summ
print(s, minsum)
