"""Все шестибуквенные слова, составленные из букв С, О, Л, Н, Ц, Е, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1. EEEEEE
2. ЕЕЕЕЕЛ
3. ЕЕЕЕЕН
4. EEEEEO
5. EEEEEC
6. ЕЕЕЕЕЦ
Определите, под каким номером в этом списке стоит последнее слово с нечётным номером, которое не начинается с букв Ц или Н и при этом содержит в своей записи ровно одну букву Ц и ровно одну букву Н.
Примечание. Слово - последовательность идущих подряд букв, не обязательно осмысленная."""
from itertools import *
i = 0
for el in product(sorted('солнце'),repeat=6):
    word =''.join(el)
    i += 1
    if i % 2 !=0 and word[0] not in 'цн' and word.count('ц') == 1 and word.count('н') == 1:
        print(i)
